{'name': '01_cnn_baseline_model', 'train_path': 'spectra_models/data/set_01/train_01.pkl', 'test_path': 'spectra_models/data/set_01/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 3, 'history': {'val_loss': [1.57667968527476, 1.530633046468099, 1.5064408966700236], 'val_accuracy': [0.2226666659116745, 0.2926666736602783, 0.32466667890548706], 'loss': [1.5947983875274658, 1.5465562098821004, 1.504818983078003], 'accuracy': [0.21716666, 0.29283333, 0.3255]}, 'evaluate': {'y_test': array([[1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 1., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 0., 1., 0.]]), 'y_test_pred': array([[0.90308034, 0.89410865, 0.39281547, 0.30951864, 0.17623892],
       [0.39793885, 0.46155915, 0.51706195, 0.5470056 , 0.5456843 ],
       [0.4211185 , 0.48221233, 0.5125025 , 0.5380941 , 0.53014654],
       ...,
       [0.39793885, 0.46155915, 0.51706195, 0.5470056 , 0.5456843 ],
       [0.9055475 , 0.3744843 , 0.29044887, 0.12245777, 0.07503033],
       [0.39793885, 0.46155912, 0.51706195, 0.5470056 , 0.5456843 ]],
      dtype=float32)}}}
