{'name': '02_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 250, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': <keras.optimizers.SGD object at 0x7f0b4073ddd0>, 'loss': 'mse', 'metrics': ['accuracy']}, 'batch_size': 16, 'epochs': 30, 'history': {'val_loss': [0.15881331137816113, 0.14292662326494854, 0.13672037589550018, 0.13517632059256235, 0.13169636364777884, 0.1349526206254959, 0.13021878496805828, 0.1285096199909846, 0.12689135857423148, 0.1250069708029429, 0.12489493302504222, 0.12299020799001058, 0.12411839965979259, 0.1215431713660558, 0.12165333720048269, 0.12140381205081939, 0.12143162973721822, 0.12038584504524867, 0.12061017195383708, 0.11817614469925562, 0.12073977559804916, 0.12759670428435008, 0.11866487473249436, 0.12013699366648992, 0.1201578108072281, 0.11802028401692709, 0.1200286749402682, 0.12323792576789856, 0.11790056761105855, 0.11537261422475178], 'val_accuracy': [0.24400000274181366, 0.36800000071525574, 0.4059999883174896, 0.4099999964237213, 0.4413333237171173, 0.3959999978542328, 0.4386666715145111, 0.43799999356269836, 0.4399999976158142, 0.4606666564941406, 0.4519999921321869, 0.47466665506362915, 0.4620000123977661, 0.4633333384990692, 0.4793333411216736, 0.4713333249092102, 0.49666666984558105, 0.4793333411216736, 0.5, 0.5093333125114441, 0.4846666753292084, 0.46933332085609436, 0.5106666684150696, 0.5080000162124634, 0.5019999742507935, 0.512666642665863, 0.5066666603088379, 0.5066666603088379, 0.5226666927337646, 0.5266666412353516], 'loss': [0.21591183519363402, 0.1816657308936119, 0.15811471778154373, 0.1485174134373665, 0.14456184536218644, 0.1431211968859037, 0.13828544733921685, 0.13548261374235154, 0.133935637931029, 0.13130219129721324, 0.12952652017275493, 0.1270611906449, 0.12536338902513186, 0.12272956359386444, 0.12105419594049453, 0.11839419025182724, 0.11540982184807459, 0.11286469561854998, 0.11147137581308683, 0.10793123326698939, 0.1062857953707377, 0.10462253713607789, 0.09953391458590825, 0.09871442605555057, 0.09582877432306608, 0.09199586374064286, 0.09007450709740321, 0.08571220136185487, 0.08197995774944623, 0.0805022029131651], 'accuracy': [0.24966666, 0.305, 0.33166668, 0.366, 0.38416666, 0.38566667, 0.41383332, 0.43066666, 0.43783334, 0.46, 0.46366668, 0.4735, 0.488, 0.495, 0.50383335, 0.5245, 0.5391667, 0.5541667, 0.5578333, 0.5825, 0.58683336, 0.5948333, 0.6218333, 0.61866665, 0.63783336, 0.65433335, 0.6705, 0.68983334, 0.70166665, 0.7046667]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[0.01272249, 0.17288764, 0.23147152, 0.34098175, 0.24193653],
       [0.0015867 , 0.00431959, 0.03202743, 0.03670078, 0.92536557],
       [0.5448901 , 0.2474931 , 0.1285583 , 0.03930865, 0.03974987],
       ...,
       [0.03516261, 0.37043643, 0.2866976 , 0.10868794, 0.1990155 ],
       [0.1093781 , 0.22093111, 0.28834817, 0.20923626, 0.1721064 ],
       [0.167426  , 0.27990326, 0.37277263, 0.11554771, 0.06435031]],
      dtype=float32)}}}
