{'name': '01_cnn_baseline_model', 'train_path': 'spectra_models/data/set_01/train_01.pkl', 'test_path': 'spectra_models/data/set_01/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 3, 'history': {'val_loss': [1.57667968527476, 1.530633046468099, 1.5064408966700236], 'val_accuracy': [0.2226666659116745, 0.2926666736602783, 0.32466667890548706], 'loss': [1.5947983875274658, 1.5465562098821004, 1.504818983078003], 'accuracy': [0.21716666, 0.29283333, 0.3255]}, 'evaluate': {'y_test': array([[1., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 1., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 1.],
       [0., 0., 0., 1., 0.]]), 'y_test_pred': array([[0.90308034, 0.89410865, 0.39281547, 0.30951864, 0.17623892],
       [0.39793885, 0.46155915, 0.51706195, 0.5470056 , 0.5456843 ],
       [0.4211185 , 0.48221233, 0.5125025 , 0.5380941 , 0.53014654],
       ...,
       [0.39793885, 0.46155915, 0.51706195, 0.5470056 , 0.5456843 ],
       [0.9055475 , 0.3744843 , 0.29044887, 0.12245777, 0.07503033],
       [0.39793885, 0.46155912, 0.51706195, 0.5470056 , 0.5456843 ]],
      dtype=float32)}}}
{'name': '01_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 3, 'history': {'val_loss': [1.5431662855148316, 1.4661852960586548, 1.4470329790115357], 'val_accuracy': [0.281333327293396, 0.36000001430511475, 0.3720000088214874], 'loss': [1.5635524781545003, 1.511407648086548, 1.4542636515299479], 'accuracy': [0.26816666, 0.3235, 0.36216667]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[0.38726172, 0.47661138, 0.53271055, 0.53947055, 0.5442094 ],
       [0.38726172, 0.47661138, 0.53271055, 0.53947055, 0.5442094 ],
       [0.524627  , 0.40419605, 0.2372647 , 0.27871412, 0.21460316],
       ...,
       [0.38726172, 0.47661138, 0.53271055, 0.53947055, 0.5442094 ],
       [0.38726172, 0.47661138, 0.53271055, 0.53947055, 0.5442094 ],
       [0.9815247 , 0.67856085, 0.28019416, 0.0614011 , 0.06756419]],
      dtype=float32)}}}
{'name': '01_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 20, 'history': {'val_loss': [1.5464315067927044, 1.4883650455474853, 1.3819102675120036, 1.380802117029826, 1.350566515604655, 1.3080068861643472, 1.3027406880060832, 1.2987368596394857, 1.2866101655960083, 1.339140817642212, 1.2930678736368815, 1.2971608072916667, 1.2981038977305095, 1.3101287746429444, 1.3069653669993082, 1.3158194716771443, 1.311916043281555, 1.306023897488912, 1.3717233928044636, 1.3467144037882488], 'val_accuracy': [0.27399998903274536, 0.32733333110809326, 0.3466666638851166, 0.33000001311302185, 0.3466666638851166, 0.35066667199134827, 0.36399999260902405, 0.3973333239555359, 0.40933331847190857, 0.40799999237060547, 0.41066667437553406, 0.4026666581630707, 0.414000004529953, 0.4059999883174896, 0.4126666784286499, 0.40533334016799927, 0.41733333468437195, 0.4193333387374878, 0.4099999964237213, 0.41333332657814026], 'loss': [1.5847652994791666, 1.5320191796620686, 1.43384361743927, 1.3736309696833293, 1.3428623991012574, 1.317325038909912, 1.2976216786702475, 1.2869535042444864, 1.2722702503204346, 1.260103377342224, 1.2515385573705038, 1.2468499279022216, 1.2372254190444947, 1.2251421918869019, 1.2161859970092774, 1.2013617766698201, 1.201825075149536, 1.188147027015686, 1.1821689573923746, 1.1733391472498576], 'accuracy': [0.253, 0.30983335, 0.32583332, 0.34733334, 0.36033332, 0.36516666, 0.37083334, 0.378, 0.41216666, 0.41483334, 0.414, 0.41733333, 0.4225, 0.42416668, 0.4285, 0.431, 0.43316665, 0.4385, 0.43866667, 0.44083333]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[0.0000000e+00, 9.9943244e-01, 9.9995583e-01, 9.9999177e-01,
        9.9999994e-01],
       [1.8060207e-05, 9.5205253e-01, 9.7397089e-01, 9.6919340e-01,
        9.8917192e-01],
       [8.4641206e-01, 1.9606075e-01, 4.7410727e-02, 3.3171773e-03,
        1.5372038e-04],
       ...,
       [2.9802322e-08, 9.9252164e-01, 9.9833101e-01, 9.9908721e-01,
        9.9984217e-01],
       [5.4510206e-02, 7.2331727e-01, 7.6791883e-01, 7.6192176e-01,
        7.9736960e-01],
       [1.6738868e-01, 3.1417048e-01, 1.7983142e-01, 4.2671174e-02,
        6.6131353e-04]], dtype=float32)}}}
{'name': '01_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 20, 'history': {'val_loss': [1.5714488048553468, 1.208006909052531, 1.2125833632151286, 1.1485683530171713, 0.907538739045461, 0.9047208434740702, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828], 'val_accuracy': [0.257999986410141, 0.48533332347869873, 0.4866666793823242, 0.468666672706604, 0.609333336353302, 0.5773333311080933, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492, 0.21199999749660492], 'loss': [1.5835182139078776, 1.4044420547485352, 1.1674707495371501, 0.9911641041437785, 0.8858696177800497, 0.7948030649820964, 1.0327397416432698, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828, 1.6094379425048828], 'accuracy': [0.22616667, 0.34983334, 0.487, 0.5615, 0.60833335, 0.65316665, 0.5265, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333, 0.19283333]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       ...,
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]], dtype=float32)}}}
{'name': '02_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 20, 'history': {'val_loss': [1.575222933769226, 1.4763597920735676, 1.2173850119908651, 1.1106238787968954, 1.2239257577260336, 1.0225228827794393, 1.0537484736442566, 1.0724772610664368, 1.1150015858014424, 1.2215851589838664, 1.1269463090896605, 1.27607865858078, 1.3641218236287436, 1.3440567808151245, 1.334681538105011, 1.458463633219401, 1.5636558375358582, 1.63004355208079, 1.6094379425048828, 1.6094379425048828], 'val_accuracy': [0.26866665482521057, 0.2786666750907898, 0.31466665863990784, 0.34933334589004517, 0.3240000009536743, 0.44600000977516174, 0.4313333332538605, 0.4466666579246521, 0.47733333706855774, 0.4819999933242798, 0.4806666672229767, 0.48266667127609253, 0.47733333706855774, 0.4806666672229767, 0.4699999988079071, 0.4779999852180481, 0.4819999933242798, 0.47733333706855774, 0.21199999749660492, 0.21199999749660492], 'loss': [1.4923287083307901, 1.3457260278066, 1.2146944281260172, 1.1208307399749755, 1.036269195874532, 0.9595674069722494, 0.8810862477620443, 0.8662287262280782, 0.8109163074493408, 0.7486559664408365, 0.7376829390525818, 0.695640767733256, 0.6785639576117197, 0.6388843264579773, 0.64301425075531, 0.6372258928616842, 0.6220225381851197, 0.5934440789222717, 1.448384284178416, 1.6094379425048828], 'accuracy': [0.25016665, 0.28266665, 0.302, 0.33316666, 0.37083334, 0.4225, 0.44783333, 0.46366668, 0.4775, 0.5028333, 0.512, 0.5215, 0.5275, 0.5416667, 0.54216665, 0.54983336, 0.55833334, 0.5656667, 0.24966666, 0.19283333]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       ...,
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]], dtype=float32)}}}
{'name': '02_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.33, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.33, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 20, 'history': {'val_loss': [1.5865653998057048, 1.4731736138661702, 1.3036126648585002, 1.1646810601552327, 1.1181356836954752, 1.0515851847330728, 1.0609763561884562, 1.012525161743164, 1.035426221847534, 1.001647846062978, 0.9498273437817891, 0.9417005910873413, 0.9435202423731486, 0.966992023785909, 0.9353577286402385, 0.9529209653536479, 0.9445756794611613, 0.9248004546165466, 0.9660676560401916, 0.9696375137964884], 'val_accuracy': [0.30666667222976685, 0.4339999854564667, 0.4026666581630707, 0.39399999380111694, 0.4020000100135803, 0.43066665530204773, 0.4286666810512543, 0.4560000002384186, 0.49533334374427795, 0.5106666684150696, 0.5333333611488342, 0.5486666560173035, 0.5540000200271606, 0.54666668176651, 0.5580000281333923, 0.5973333120346069, 0.5973333120346069, 0.6193333268165588, 0.6046666502952576, 0.6186666488647461], 'loss': [1.5830024642944336, 1.4419815991719565, 1.3402777875264487, 1.2488788735071819, 1.1836718983650207, 1.1266728785832723, 1.0792970107396445, 1.0303327128092448, 1.017638888835907, 0.9649882723490397, 0.9416515407562256, 0.9003517594337463, 0.848907433827718, 0.8455607452392578, 0.8131424919764201, 0.7934550558725992, 0.7658683724403381, 0.7474039956728618, 0.740696874777476, 0.7039286375045777], 'accuracy': [0.22733334, 0.3245, 0.37933335, 0.37983334, 0.39166668, 0.42283332, 0.43516666, 0.45583335, 0.4755, 0.51133335, 0.53183335, 0.558, 0.586, 0.59433335, 0.60733336, 0.6195, 0.6335, 0.63666666, 0.6465, 0.65833336]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[0.00000000e+00, 1.17212534e-04, 1.95781469e-01, 3.92396241e-01,
        4.92330670e-01],
       [0.00000000e+00, 1.25169754e-06, 9.61641669e-02, 3.59401047e-01,
        5.77627897e-01],
       [2.98023224e-07, 2.58600354e-01, 7.09101558e-03, 2.60472298e-05,
        1.78813934e-07],
       ...,
       [0.00000000e+00, 1.72572732e-02, 1.21164918e-01, 2.29479074e-02,
        9.79125500e-04],
       [0.00000000e+00, 4.91886139e-02, 3.89222503e-01, 3.11945945e-01,
        2.27803767e-01],
       [5.96046448e-08, 1.93117857e-01, 3.34194303e-02, 3.22103500e-04,
        5.45382500e-06]], dtype=float32)}}}
{'name': '02_cnn_baseline_model', 'train_path': 'spectra_generator/data/train_01.pkl', 'test_path': 'spectra_generator/data/test_01.pkl', 'model_params': {'config': '{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1001, 10, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 1], "padding": "valid", "strides": [2, 1], "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.33, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.33, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "keras_version": "2.3.1", "backend": "tensorflow"}', 'compile_dict': {'optimizer': 'adam', 'loss': 'categorical_crossentropy', 'metrics': ['accuracy']}, 'batch_size': 32, 'epochs': 20, 'history': {'val_loss': [1.604212361017863, 1.3839814189275106, 1.1229102233250936, 1.1340171740849814, 1.030837258974711, 0.9620502684911092, 0.9711204520861307, 0.9390045793851217, 0.898084839185079, 1.0889338779449462, 0.87300994237264, 0.8987088518142701, 0.8754394130706787, 0.9028481073379516, 0.8998539773623149, 0.9948771066665649, 0.9483639691670736, 0.9937366291681925, 1.0743048054377238, 1.6094379425048828], 'val_accuracy': [0.22200000286102295, 0.41733333468437195, 0.5373333096504211, 0.46933332085609436, 0.5239999890327454, 0.5666666626930237, 0.54666668176651, 0.5646666884422302, 0.6100000143051147, 0.5306666493415833, 0.6079999804496765, 0.5926666855812073, 0.6213333606719971, 0.5953333377838135, 0.6166666746139526, 0.578000009059906, 0.6119999885559082, 0.6046666502952576, 0.6039999723434448, 0.21199999749660492], 'loss': [1.594586441675822, 1.3973748429616293, 1.2355244550704956, 1.162179030418396, 1.1000879400571186, 1.0578010743459065, 1.0291393785476683, 0.9698231665293375, 0.9110116475423177, 0.8975878190994263, 0.8671766773859659, 0.8363658796946207, 0.7893518021901449, 0.7752690650622049, 0.7226790654659271, 0.7110646854241689, 0.6528214821815491, 0.6188041928609213, 0.5812616217136383, 0.5865387172698975], 'accuracy': [0.25683334, 0.39383334, 0.425, 0.4545, 0.483, 0.5105, 0.53066665, 0.5416667, 0.5653333, 0.57, 0.58533335, 0.6078333, 0.63383335, 0.63883334, 0.67433333, 0.6788333, 0.7048333, 0.72083336, 0.74, 0.7416667]}, 'evaluate': {'y_test': array([[0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.],
       [0., 1., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0.]]), 'y_test_pred': array([[1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       ...,
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.],
       [1., 1., 1., 1., 1.]], dtype=float32)}}}
